export const RULES_MOCK_CONTENT = `
<h1>컴퓨터공학전공(컴퓨터공학부) 졸업논문 운영세칙</h1>

<h2>(1) 졸업 논문 대상자</h2>
<p>(1-1) 이 세칙에서 정한 졸업 논문의 절차 및 심사 규칙은 다음의 학생을 대상으로 한다.</p>
<p>    (1-1-1) 차년도 2월 졸업예정인 4학년 1학기 학생</p>
<p>    (1-1-2) 가을 학기 복학한 4학년 2학기 재학생</p>
<p>    (1-1-3) 8월 졸업예정인 4학년 2학기 학생</p>
<p>(1-2) 컴퓨터공학전공(컴퓨터공학부) 복수전공 학생도 동일한 일정과 기준을 적용한다.</p>
<p>(1-3) 졸업논문 심사 대상자는 컴퓨터공학기초캡스톤디자인과 컴퓨터공학심화캡스톤디자인을 모두 이수해야한다. 단, 부득이한 경우 학과교수회의를 통해 예외를 인정할 수 있다.</p>
<p>(2022년 1월 20일 신설, 2023년 8월 이전 졸업 예정자의 경우 컴퓨터공학기초캡스톤디자인 과목은 이수하지 않아도 된다.)</p>
<p style="background-color: rgb(238, 238, 238); padding: 10px;"><em><span style="color: rgb(255, 0, 0);">(1-4) 졸업논문 심사 대상자는 온라인 안전교육을 연 2회 모두 이수해야한다. (2024학년부터 연 2회로 총 8회) (2023년 9월 26일 신설)</span></em></p>

<h2>(2) 졸업 논문 진행 절차</h2>
<p>(2-1) 각 단계의 구체적 일정은 매년 졸업논문 담당교수가 지정하고 별도 공지한다.</p>
<p>(2-2) 다음 각 호는 차년도 2월 졸업 예정자에 준한다.</p>
<ul>
<li>졸업논문대상자등록신청서 (이하 졸업논문신청서) 제출 (3월 중순)</li>
<li>제안서 제출 (3월 말)</li>
<li>중간보고서 제출 (9월 초순)</li>
<li>최종졸업논문 제출 (12월 말)</li>
<li>결과 발표 (12월 초)</li>
</ul>
<p>(2-3) 다음 각 호는 차년도 8월 졸업 예정자에 준한다. 4학년 2학기 복학생의 경우 다음 일정을 6개월 순연하여 진행한다.</p>
<ul>
<li>졸업논문신청서 제출 (3월 중순)</li>
<li>제안서 제출 (3월 말)</li>
<li>중간보고서 제출 (4월 말)</li>
<li>최종졸업논문 제출 (5월 말)</li>
<li>결과 발표 (6월 초)</li>
</ul>
<p>    (2-4) 졸업 예정년도 전에 그 당해 년도의 조건으로 졸업 논문 심사를 통과한 경우는 그대로 인정된다. 단, 한 학기 이상 휴학 후 복학한 경우 과년도 졸업논문인정신청서를 제출해야 한다.</p>
<p>(2-5) 대상자가 만족해야 하는 단계 별 요건</p>
<p>        (2-5-1) 졸업 논문 신청 : 졸업논문신청서를 기한 내에 제출하여 신청하여야 졸업 논문 대상자로 등록된다. 학과에서는 등록된 신청자를 대상으로 지도교수를 배정한다.</p>
<p>        (2-5-2) 제안서 제출 : 논문 주제와 범위를 명시한 제안서를 작성하여 지정된 기한 내에 지도교수와 면담 후 제출해야 한다. (제안서 및 제안면담확인서 제출)</p>
<p>        (2-5-3) 중간보고서 제출 : 졸업 논문의 진행에 대한 중간보고서를 지정된 기한 내에 제출하여야 한다.</p>
<p>        (2-5-4) 최종논문 제출 : 정해진 기간까지 최종졸업논문을 제출한다. 최종졸업논문은 지도교수와 면담하여 제출 승인을 받은 후 제출한다. (최종졸업논문은 파일로 온라인 제출하고 출력한 후 지도교수 날인 제출해야 함)</p>
<p>        (2-5-5) 이상에서 정한 기한 내에 제출을 완료하지 못한 경우 경고가 주어지며 2회 이상 경고를 받은 자는 연기사유서 작성 후 졸업논문담당교수가 승인해야 이후 절차를 진행할 수 있다.</p>

<h2>(3) 졸업 논문 사정 원칙</h2>
<p>(3-1) 제출된 논문의 서면 심사는 심사위원 2인 이상이 각 10점 만점으로 심사하고 평균을 낸다.</p>
<p>(3-2) 평균 점수가 7점 미만인 경우는 2차 구두 심사를 받아야 한다.</p>
<p>(3-3) 서면 심사의 평균 점수가 4점 미만인 경우는 서면 심사에서 탈락한다.</p>
<p>(3-4) 구두 심사는 심사위원 3인이 채점하는 것을 원칙으로 하고 교육과정위원회의 평가 원칙에 따라 통과 혹은 탈락을 결정한다.</p>

<h2>(4) 졸업논문의 형식</h2>
<p>    (4-1) 최종졸업논문은 경기대학교 졸업논문양식에서 정한 파일 형식을 따라야 하며, 표지, 요약, 목차, 서론, 본론, 결론, 참고문헌을 포함하여야 한다. 지정된 양식을 따르지 않은 논문은 심사 대상에서 제외된다.</p>
<p>(4-2) 구현 논문으로 진행할 수 있으며, 다음과 같은 경우 2차 심사를 받아야 한다.</p>
<ul>
<li>전공 졸업자로서 수준에 미달한 경우</li>
<li>타인의 시스템을 카피한 경우</li>
</ul>
<p>(4-3) 조사 논문으로 진행할 수 있으며, 다음과 같은 경우 2차 심사를 받아야 한다.</p>
<ul>
<li>타인의 논문이나 인터넷 상의 자료를 50% 이상 도용한 경우</li>
<li>본인의 독자적인 의견이나 결론의 도출 없는 사실 및 정보의 나열인 경우</li>
</ul>

<h2>(5) 졸업논문자격 대체 인정</h2>
<p>    (5-1) 일정 수준 이상의 전공 능력을 인정받은 졸업 예정자에 대해서는 졸업논문 자격을 대체인정 할 수 있다. 다음 각 호에 해당하는 학생은 졸업논문자격 대체인정 대상자가 된다.</p>
<p>(5-1-1) 일정 수준 이상의 전공 자격증을 취득한 자</p>
<p>(5-1-2) 전공 관련 전국 규모 대회에서 수상한 경력이 있는 자</p>
<p>(5-1-3) 전공 관련 전국 규모 학술대회에서 논문을 발표한 자</p>
<p>    <span style="color: rgb(0, 89, 255);">(5-2) 졸업논문자격 대체는 전공필수 과목인 컴퓨터공학심화캡스톤디자인(기존 컴퓨터공학캡스톤디자인) 과목을 이수한 경우에만 인정된다. (2018년 1월 22일 신설, 2012 교육과정 대상자에 대해 한시적으로 적용되며, 2011년도 이전 입학생은 이 조건이 면제됨)</span></p>
<p>(5-1-4) 경기대 주관 SW 부트캠프를 수료하여 이수증을 받급받은 자 (2023년 9월 26일 신설)</p>
<p>(5-1-5) 소프트웨어 역량검정시험(TOPCIT) 300점 이상 득점한 자 (2024년 9월 30일 수정)</p>
<p>(5-1-6) SW관련 인턴 경력을 증빙할 수 있는 자 (지도교수 확인 필요) (2024년 9월 30일 신설)</p>

<p>(5-3) 심사 요청 방법</p>
<p>        (5-3-1) 본인이 해당하는 사항에 대해 증빙서류를 구비하여 제출한 후 대체인정신청서를 작성하여 졸업논문 지도교수와의 상담을 통해 승인을 요청한다.</p>
<p>        (5-3-2) 상담 시기는 정기 상담 (제안서, 중간보고서, 최종논문 제출 전) 혹은 수시 상담을 이용한다.</p>

<p>(5-4) 전공 자격증 대체 방법</p>
<p>        (5-4-1) 해당년도 심사대상 전공 자격증 목록은 3월에 학과 홈페이지를 통해 공지한다. 2017년도 인정대상 목록 : 정보처리기사, CCNA·CCNP(CISCO), 정보보호전문가(SIS) 2급 이상, SCSA·SCNA 솔라리스자격증 (SUN), SQLD·SQLP(데이터베이스) 자격증, 빅데이터분석기사(2022.9월 추가), OCP 오라클(데이터베이스) 자격증, MCSE 서버자격증 (MS), 그 외 국가공인민간자격증</p>
<p>        (5-4-2) 8월 졸업자의 경우 전년도에 공지한 목록의 자격증을 취득한 경우도 대체인정 대상자가 되는 것으로 한다.</p>
<p>        (5-4-3) 목록에 없는 자격증에 대해서는 졸업논문 지도교수와의 상담을 통해 심사를 요청할 수 있다.</p>
<p>        (5-4-4) 자격증 사본과 대체인정신청서를 제출하여 지도교수의 승인을 통해 졸업논문 대체 자격을 인정한다.</p>

<p>(5-5) 전국 규모 대회 수상에 의한 대체 방법</p>
<p>        (5-5-1) 전국 규모 대회에서 개인으로 본상 이상(장려상 제외) 수상한 경우 인정한다.</p>
<p>(5-5-2) 시상일은 졸업논문 심사일 기준으로 최근 1년 이내여야 한다.</p>
<p>        (5-5-3) 시상의 경우 상장과 기타 증빙자료(심사용 제출파일 등) 및 대체인정신청서를 제출하여 지도교수의 승인을 통해 졸업논문 대체 자격을 인정한다.</p>

<p>(5-6) 학술대회 발표에 의한 대체 방법</p>
<p>        (5-6-1) 전국 규모 학술대회 발표의 경우 지도교수의 지도에 의해 작성된 논문으로 대상자 본인이 주저자여야 한다.</p>
<p>        (5-6-2) 졸업논문 심사 시점에서 최근 1년 이내에 학술대회에서 구두(또는 포스터) 발표한 논문을 인정한다. 심사일 이후의 발표 예정 논문은 인정하지 않는다.</p>
<p>        (5-6-3) 학술대회 발표를 증빙할 수 있는 프로그램과 출판된 논문 사본 및 대체인정신청서를 제출하고 지도교수의 승인을 통해 졸업논문 대체 자격을 인정한다.</p>

<p>(5-7) 대체인정 심사 방법</p>
<p>        (5-7-1) 해당하는 사항에 대한 증빙자료와 대체인정신청서를 학과 홈페이지 졸업논문 시스템을 통해 제출한다. 제출 시 인정 시기와 요건을 본인이 직접 확인해야 한다.</p>
<p>        (5-7-2) 대체인정신청서를 출력하여 상담 후 날인 제출해야 한다. 단, 사정에 의해 면담이 어려운 경우 온라인 승인이나 도장 날인 등 다른 방법으로 승인할 수 있다.</p>
<p>        (5-7-2) 상담 시기는 정기 상담 (제안서, 중간보고서, 최종논문 제출 전) 혹은 수시 상담을 이용한다.</p>
<p>        (5-7-3) 대체인정 승인을 받은 이후의 졸업논문 진행 절차는 면제된다. 그러나 승인 이전에는 절차에 따라 제안서, 중간보고서, 최종논문 제출을 진행해야 한다.</p>
<p>        (5-7-4) 자격증 및 학술대회 발표에 의한 대체 신청은 최종논문 마감일 2주전에 완료되어야 한다.</p>

<h2>(6) 학과의 운영</h2>
<p>(6-1) 졸업논문 진행 교수는 매학기 시작과 함께 학과교수회의에서 결정한다.</p>
<p>    (6-2) 졸업논문 지도교수는 졸업논문 신청자에 대해 졸업논문 진행교수가 정한 원칙에 따라 배정하고 제안서 제출기한 1주일 이전에 공지한다.</p>
<p>    (6-3) 기타 졸업논문의 진행에 관한 사정원칙의 변경 및 결정을 요하는 사항은 프로그램운영위원회에서 결정한다.</p>
<p>(6-4) 졸업예정자가 위 2항 및 3항의 절차에서 지연 또는 미비의 사유가 발생한 경우 연기사유서를 작성하여 졸업논문 진행교수의 승인을 받아야 하며, 당해년도 졸업논문 진행교수의 결정에 의해 해당 학기 졸업논문 탈락 또는 졸업논문 서면 심사 감점을 적용할 수 있다.</p>
<p>    (6-5) 매 학기 학과교수회의의 심사를 통하여 일정 수준 이상의 전공 능력을 인정받은 졸업 예정자에 대해서는 졸업논문자격을 대체 인정 할 수 있다. 졸업논문자격 대체 인정은 위 5항에서 정한바와 같다.</p>
<p>    (6-6) 졸업논문은 학과 홈페이지의 <u>졸업논문 온라인 시스템</u>을 통하여 제출 및 승인을 진행하게 되며 대상자는 졸업논문의 공지사항과 일정을 확인하고 그에 따라 졸업논문 진행 절차의 요건을 만족해야 한다. 대상자가 졸업논문 온라인 시스템에서 요구되는 일정과 요건을 만족하지 못한 경우 졸업논문 심사 대상에서 제외된다. (2018년 1월 22일 신설)</p>

<h2>(7) 규정의 적용</h2>
<p>(7-1) 2018년 1월 22일 학과교수회의의 의결에 따라 개정한다.</p>
<p>(7-2) 이 규정은 2018년 3월부터 적용되며 2018년 8월 졸업자부터 유효하다.</p>

<h3>졸업논문 심사 양식</h3>
<p>[졸업논문 양식 1번] 졸업논문신청서</p>
<p>[졸업논문 양식 2번] 제안서</p>
<p>[졸업논문 양식 3번] 중간보고서</p>
<p>[졸업논문 양식 4번] 최종논문</p>
<p>[졸업논문 양식 5번] 과년도 졸업논문인정신청서</p>
<p>[졸업논문 양식 6번] 제안면담확인서</p>
<p>[졸업논문 양식 7번] 대체인정신청서</p>
<p>[졸업논문 양식 8번] 졸업논문심사표</p>
<p>[졸업논문 양식 9번] 연기사유서</p>
<p>- 졸업논문 양식 1-4번은 학과 홈페이지에 직접입력하므로 별도의 양식파일 불요</p>
<p>- 졸업논문 양식 5, 6, 8, 9번 양식은 과사에 문의</p>
<p>- 졸업논문 양식 7번은 공지사항의 졸업논문 대체인정 게시물을 확인</p>
`;
