const notices = [
  {
    id: 1,
    title: '테스트 공지 1',
    description:
      '테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다.',
  },
  {
    id: 2,
    title: '테스트 공지 2',
    description:
      '테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다.',
  },
  {
    id: 3,
    title: '테스트 공지 3',
    description:
      '테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다. 테스트용 공지입니다.',
  },
] as const;

export { notices };
