export const descriptionData = [
	{
		id: 1,
		title: '신청접수',
		description:
			`매학기 개강 후 2주 이내 신청서를 작성하여 접수해야 합니다. 신청서는 졸업논문 과정을 시작하기 위한 필수 요건으로 졸업시기, 졸업논문 유형, 자격증 등 기타 자격 준비 여부 등을 결정하여 양식에 따라 작성하여 신청합니다.

(1) 졸업논문을 작성하는 경우 : 기타자격 준비현황 카테고리 중 '논문' 선택
(2) 학술대회 발표로 진행하는 경우 : 기타자격 준비현황 카테고리 중 '학술대회발표', '기타' 선택 -> '기타' 내용에 관련 학술대회 명칭 기재 (지도교수의 지도에 의해 작성된 논문으로 본인이 제 1저자일 경우에만 해당됨. 졸업논문 심사 시점에서 최근 1년 이내의 학술대회에서 구두 또는 포스터로 발표한 논문만 인정됨)
(3) 졸업논문대체자격증을 제출하는 경우 : 기타자격 준비현황 카테고리 중 '자격증', '기타' 선택 -> '기타' 내용에 어떤 자격증인지 기재 (TOPCIT의 경우 2023년 10월 이후부터 이수된 이수증만 인정됨)
(4) 전공 관련 전국 규모 대회, 공모전에서 수상한 경력이 있는 경우 : 기타자격 준비현황 카테고리 중 '기타' 선택 -> '기타' 내용에 입상한 대회, 공모전 명칭을 기재 (전국 규모 대회에서 개인으로 본상 이상-장려상 제외- 수상한 경우만 인정, 시상일은 졸업논문 심사일 기준으로 최근 1년 이내여야 함)`.trim(),
	},
	{
		id: 2,
		title: '제안서',
		description:
			`제안서는 특별히 지정된 양식은 없으며, 논문 제목과 대략의 계획을 작성한 한페이지 분량에 따라 작성하여 신청합니다. 제안서는 캡스톤 설계 프로젝트의 주제로 제출하는 것을 권장합니다. 분량이 짧을 경우, 반려될 수 있음을 알려드립니다.

(ⅰ)신청서 접수 완료.
(ⅱ)제안서 작성 후 해당 파일 첨부하여 지도교수님께 검토 메일 송부(학번 및 성함, 연락처 기재 필수).
(ⅲ)지도교수님 피드백 및 확인 후 제출 기한 내 온라인관리시스템에서 제안서 [제출] 버튼 클릭하여 내용 작성

(1) 졸업논문을 작성하는 경우 : 논문 제목, 작성 예정 논문의 카테고리 구분, 논문 키워드, 논문의 내용(프로젝트 명, 추진 배경 및 개발 내용, 주요 기능 등)이 상세히 기재되어 있어야 합니다.
(2) 캡스톤 관련 프로젝트에서 이미 논문을 작성한 경우 : 본인이 제1저자일 경우에만 해당됩니다. 논문 제목, 논문의 카테고리 구분, 논문 키워드, 논문의 내용(위와 동일)이 상세히 기재되어 있어야 합니다.
(3) 졸업논문대체자격증을 제출하는 경우 : 어떤 자격증을 딸 것인지[SQLD, 정보처리기사, SW부트캠프이수증, TOPCIT(응시만 해도 O) 등 졸업논문을 대체할 수 있는 자격증] , 언제 이수(혹은 이수 예정)했는지 간략히 기재되어 있어야 합니다.
(4) 전공 관련 전국 규모 대회, 공모전에서 수상한 경력이 있는 경우 : 입상한 대회/공모전의 명칭, 날짜, 수상 내역의 간략한 설명이 기재되어 있어야 합니다.`.trim(),
	},
	{
		id: 3,
		title: '중간보고서',
		description:
			`중간보고서는 10쪽 내외의 문서로 졸업논문의 약 50% 정도 진행된 결과를 졸업 논문 형식에 맞게 작성하여 제출하게 됩니다. 화면, 흐름, DB 설계 등을 포함하게 됩니다.

(ⅰ)제안서 제출 완료 및 승인
(ⅱ)제출 기한 내 메일 통하여 지도교수님께 중간보고서 검토 받은 후 중간보고서 파일 온라인관리시스템에 업로드.
(ⅲ)논문 제출 예정 학생은 '연구윤리준수서약서' 함께 업로드바랍니다. (해당 양식 공지사항 참고)

(1) 졸업논문을 작성하는 경우 : 위의 양식에 따라 진행 과정의 50% 정도를 기재하여 제출
(2) 학술대회 발표로 진행하는 경우 : 해당 사항 진행과정을 간단히 명시하여 제출
(3) 졸업논문대체자격증을 제출하는 경우 : 해당 사항 진행과정을 간단히 명시하여 제출
(4) 전공 관련 전국 규모 대회, 공모전에서 수상한 경력이 있는 경우 : 해당 사항 진행과정을 간단히 명시하여 제출`.trim(),
	},
	{
		id: 4,
		title: '최종보고서',
		description:
			`최종보고서는 졸업논문 양식에 따라 개발 또는 조사 논문의 주제를 체계적으로 정리한 것으로 주제, 목표, 설계, 구현, 평가 등의 내용을 포함하고 서론, 본론, 결론의 순서로 구성되어야 합니다. 인터넷 등 타인이 작성한 내용을 인용없이 복사 게재할 수 없습니다.

(1) 졸업논문을 작성하는 경우 : 중간보고서에 대한 지도교수님 피드백 참고하여 내용 보완, 해당 사항 진행과정을 간단히 명시하여 제출
(2) 학술대회 발표로 진행하는 경우 : 해당 사항 진행과정을 간단히 명시하여 제출
(3) 졸업논문대체자격증을 제출하는 경우 : 생략
(4) 전공 관련 전국 규모 대회, 공모전에서 수상한 경력이 있는 경우 : 해당 사항 진행과정을 간단히 명시하여 제출`.trim(),
	},
	{
		id: 5,
		title: '최종 통과',
		description:
			'최종보고서는 지도교수 포함 3인 이상의 심사위원의 평가에 의해 통과 여부가 결정됩니다. 심사에서 통과된 경우 승인으로 표시됩니다.',
	},
	{
		id: 6,
		title: '기타자격',
		description:
			`최종보고서 또는 기타자격확인서가 승인된 경우 학과장의 심의에 의해 최종통과가 결정됩니다. 최종통과 후 졸업자격으로 인정됩니다.

(1) 졸업논문을 작성하는 경우 : 완성된 논문에 관한 '최종보고서'와 '연구윤리준수서약서'제출
(2) 학술대회 발표로 진행하는 경우 : 학술대회 발표를 증빙할 수 있는 프로그램과 출판된 '논문 사본', '졸업논문대체인정신청서', '졸업논문대체인정 상담내역서' 제출 (해당 양식은 학과 홈페이지에 존재)
(3) 졸업논문대체자격증을 제출하는 경우 : 본인의 얼굴 사진이 포함되어 있는 '자격증 원본 파일' 혹은 수료증/이수증 제출
(4) 전공 관련 전국 규모 대회, 공모전에서 수상한 경력이 있는 경우 : 수상을 증빙할 수 있는 서류나 사진파일 혹은 대회에 참가한 논문 및 보고서, '졸업논문 대체인정 상담내역서' 제출`.trim(),
	},
];

export const scheduleData = [
	{
		key: '1',
		stage: '신청접수',
		startDate: '2025-10-02',
		endDate: '2025-10-16',
		status: '진행중',
	},
	{
		key: '2',
		stage: '제안서',
		startDate: '2025-10-17',
		endDate: '2025-10-30',
		status: '대기',
	},
	{
		key: '3',
		stage: '중간보고서',
		startDate: '2025-11-01',
		endDate: '2025-12-10',
		status: '대기',
	},
	{
		key: '4',
		stage: '최종보고서',
		startDate: '2025-11-01',
		endDate: '2025-12-10',
		status: '대기',
	},
	{
		key: '5',
		stage: '최종 통과',
		startDate: '2025-11-01',
		endDate: '2025-12-10',
		status: '대기',
	},
	{
		key: '6',
		stage: '기타자격',
		startDate: '2025-10-17',
		endDate: '2025-12-10',
		status: '대기',
	},
];
